{
  "employment": {
    "title": "Employment History",
    "content": [
      {
        "title": "Cloudflare",
        "website": "https://www.cloudflare.com",
        "logo": "/cloudflare.png",
        "content": "Building scalable SSR solutions and providing better user experience by integrating 3rd party platforms to our Core network.",
        "tools": "Java(Type)script, Node, Astro, React, GraphQL, Gatsby, Golang, Kubernetes, Helm, GCP, Terraform, Postgres",
        "tenure": "2021 - Present",
        "job": "Senior Systems Engineer"
      },
      {
        "title": "Starship HSA",
        "website": "https://starshiphsa.com/",
        "logo": "/starshiphsa.jpeg",
        "content": "Building React Native based iOS and Android application to help monitor HSA Bank transactions. As well as a platform for stock trading.",
        "tools": "Java(Type)script, Node, Prisma, React Native, GraphQL, Express, Lerna, Postgres, AWS, Kubernetes, Helm",
        "tenure": "2020 - 2021",
        "job": "Senior Software Engineer"
      },
      {
        "title": "YouEarnedIt, Kazoo, Worktango",
        "website": "https://www.worktango.com/",
        "logo": "/worktango.png",
        "content": "Building and scaling our Ruby on Rails platform while also helping build our dashboard using React. Eventually transitioned to SRE where I helped build and maintain our infrastructure in GCP using Kubernetes.",
        "tools": "Java(Type)script, Ruby on Rails, GraphQL, React, MongoDB, GCP, Kubernetes, Spinnaker, Helm",
        "tenure": "2018 - 2020",
        "job": "Senior Software Engineer"
      },
      {
        "title": "HomeAdvisor",
        "website": "https://www.homeadvisor.com/",
        "logo": "/homeadvisor.png",
        "content": "Building our custom frontend framework to help with our survey platform. Migrated from custom framework to React.",
        "tools": "Java(Type)script, Java, React, MySQL",
        "tenure": "2017 - 2018",
        "job": "Software Engineer"
      },
      {
        "title": "OutboundEngine",
        "website": "https://www.outboundengine.com/",
        "logo": "/outboundengine.png",
        "content": "Began as a Web Designer to build our applications UI/UX. Transitioned to Software Engineer helping build our application's frontend using ExtJs and React. Worked with maintaining and building dynamic user websites with Java and MySQL.",
        "tools": "Javascript, Java, ExtJS, React, MySQL, Photoshop, Illustrator",
        "tenure": "2014 - 2017",
        "job": "Web Designer, Software Engineer"
      },
      {
        "title": "Atomic Design and Consulting",
        "website": "https://www.atomicdc.com/",
        "logo": "/atomicdc.jpeg",
        "content": "Helped design and build Wordpress themes for various customers. Worked with clients to help build their website designs and then led the development team into creating themes to be maintained by the clients.",
        "tools": "Wordpress, PHP, Javascript, Photoshop, Illustrator, Sketch",
        "tenure": "2013 - 2014",
        "job": "Web Designer, Software Engineer"
      }
    ]
  },
  "corporate": {
    "chapter": {
      "1": {
        "title": "Chapter 1: Don't settle for fast food developers.",
        "content": "I am a a multidisciplinary Full Stack engineer. Bringing to the table a plethora of skills and abilities alongside my 10+ years experience."
      },
      "2": {
        "title": "Chapter 2: More to Full Stack than frontend and backend.",
        "content": {
          "1": "Having had a a range of mentors and wonderful managers. I have been able to craft my skills in every aspect of the tech world and software development lifecycle to fit a multitude of positions.",
          "2": "I got my start in the early 2013s as a web designer. At first building graphic designs for sign printing teaching myself the basics of Adobe Illustrator and Photoshop, etc. That led into a world of building UIs and UX workflows for websites. Eventually the curiosity grew, and so did the learning, continuing the path into software development learning Javascript to build upon my designs and turn them into tangible websites. Naturally, this led into backend development, learning Java, Ruby on Rails, and eventually settling into Golang constructing the backend pieces to power my frontend skills. And as time always tells, this inevitably led to learning the ins and outs of devops, infrastructure, and cloud computing. Allowing me to perform every aspect of the lifecycle in isolation or within a team."
        }
      },
      "3": {
        "title": "Chapter 4: Where are we today?",
        "content": {
          "1": "Today I continue working as a Full Stack Engineer, continuing my learning and spending more time getting comfortable in Golang. Building more serverless and client side frontend pieces using Astro and Edge based SSR websites.",
          "2": "Outside of the world of tech I am working towards writing more and spending more time sketching and painting again. Taking care of and spending time with my family. All the while continuing to cook and jot down movie reviews from time to time."
        }
      },
      "4": {
        "title": "Chapter 5: Where do we go from here?",
        "content": "If you have made it this far you may have an interest in working with me. That's great. Shoot me an email, let's get started."
      },
      "skills": {
        "title": "The tools of the trade",
        "content": [
          {
            "title": "Design 2012 - 2014:",
            "items": ["Adobe Illustrator", "Abode Photoshop", "Figma", "Sketch"]
          },
          {
            "title": "Frontend Development 2014 - Present Day:",
            "items": [
              "Javascript",
              "Typescript",
              "Astro",
              "React",
              "Preact (do I list this along with React? idc)",
              "Vue",
              "Gatsby",
              "GraphQL (client)"
            ]
          },
          {
            "title": "Backend Development 2016 - Present Day:",
            "items": [
              "Javascript (NodeJS)",
              "Typescript",
              "Java",
              "Ruby on Rails",
              "Golang",
              "MySQL",
              "Postgres",
              "MongoDB",
              "GraphQL (server)"
            ]
          },
          {
            "title": "SRE, DevOps, Infrastructure 2018 - Present Day:",
            "items": [
              "Kubernetes",
              "Terraform",
              "Helm",
              "Docker",
              "GCP",
              "AWS",
              "Linux, bash, etc..."
            ]
          },
          {
            "title": "Just general tech industry 2014 - Present Day:",
            "items": [
              "Git(hub)",
              "Jira and the Atlassian Suite",
              "Google (Google Tag Manager, Analytics, Optimize, etc...)",
              "Adobe (a/b testing, etc...)",
              "CMS (Contentful, MDX, Sanity.io, Ghost)",
              "Draw.io"
            ]
          }
        ]
      }
    }
  },
  "fun": {
    "chapter": {
      "1": {
        "title": "Chapter 1: Synergy, moving the needle, game changing.",
        "content": "In the dynamic landscape of technological prowess, Kevin Wynn emerges as a paragon of multidisciplinary excellence, seamlessly navigating the realms of frontend, backend, and devops/infrastructure with unparalleled finesse. His seasoned professional tenure in these arenas has bestowed upon him a transcendental insight, a veritable omniscience that transcends the mundane constraints of the software development lifecycle. Kevin's strategic acumen manifests in decisions that not only meticulously weigh each facet but transcend conventional perspectives, providing an avant-garde vantage point that not merely alleviates friction but orchestrates a symphony of operational optimization. His corporate odyssey is a saga of transcendence, where each keystroke resonates with the harmonious cadence of corporate conquest."
      },
      "2": {
        "title": "Chapter 2: The epitome of Comprehensive Stack Proficiency.",
        "content": {
          "1": "In a pivotal juncture of his professional journey, Kevin Wynn received sagacious counsel from a former manager who asserted that true mastery of Full Stack Engineering necessitates a profound immersion in the realms of devops and infrastructure. This revelation became an indelible mantra that has reverberated through his career. Kevin internalized this wisdom, recognizing that while his proficiency in frontend and backend domains was commendable, achieving true Full Stack status demanded an encompassing comprehension of the entire the development process, marking a transformative chapter in his pursuit of corporate excellence.",
          "2": "Embarking on his professional odyssey, Kevin Wynn commenced his journey in the realm of web design, honing his craft over several years. This initial foray laid the foundation for his transition into frontend development, where he seamlessly translated his design concepts into tangible digital interfaces. As his expertise evolved, Kevin delved into backend development, orchestrating the intricate data flow that empowered his frontend creations. The progression continued into the domain of infrastructure, where he meticulously crafted the digital abode to house his comprehensive creations. Kevin now invites you to a detailed exploration of his professional chronicles, unveiling the intricacies of his experiences, the temporal tapestry of his endeavors, and the array of tools that have been wielded across his illustrious career. Consider this narrative a curated menu, offering a tantalizing glimpse into the culinary artistry of Kevin's professional repertoire."
        }
      },
      "3": {
        "title": "Chapter 4: An avant-garde dining establishment, a glimpse into tomorrow's trends, and a nostalgic echo from yesteryears beckoning.",
        "content": {
          "1": "In contemplating the corporate trajectory, questions of identity and purpose take center stage. Currently situated in the United States, a serendipitous encounter with a Swiss citizen led to marriage and the addition of a daughter, prompting a shift in priorities toward familial prosperity. The rebellious edges of punk rock rebellion soften as aspirations for a superior education and a tranquil home with a robust foundation take precedence. The decision to uproot and relocate to Switzerland is driven by a commitment to crafting an elevated life for the family. Departing from the conventional punk ethos, the audacious act lies in prioritizing family well-being over the trivialities of the corporate rat race. True punk rock, in this narrative, is found in asserting autonomy and embracing happiness through familial care, a paradigm shift away from the inconsequential buzz of corporate discussions.",
          "2": "In conclusion, if you've successfully navigated to this juncture, it's evident that you possess a discerning sense of humor and a commendable lack of inclination towards taking life overly seriously. Your alignment with such values makes you an ideal collaborator for my professional endeavors. Moving forward, I'll meticulously detail my professional experience – a narrative that might pique your interest. If you find resonance in the prospect of remote collaboration and can anticipate my imminent transition to a Swiss work setting, I invite you to engage in a conversation about potential collaboration."
        }
      },
      "4": {
        "title": "Chapter 5: I am well-suited for the job; let's move forward with the offer.",
        "content": "Shoot me an email; let's not drag this out. Time is money, you know."
      },
      "skills": {
        "title": "Corporate Culinary Playbook.",
        "content": [
          {
            "title": "Design 2012 - 2014:",
            "items": [
              "Adobe Illustrator",
              "Abode Photoshop",
              "Figma",
              "Sketch (rip)"
            ]
          },
          {
            "title": "Frontend Development 2014 - Present Day:",
            "items": [
              "Javascript",
              "Typescript",
              "Astro",
              "React",
              "Preact (do I list this along with React? idc)",
              "Vue",
              "Gatsby",
              "GraphQL (client)"
            ]
          },
          {
            "title": "Backend Development 2016 - Present Day:",
            "items": [
              "Javascript (node, ya know how it is)",
              "Typescript",
              "Java",
              "Ruby on Rails",
              "Golang",
              "MySQL",
              "Postgres",
              "MongoDB",
              "GraphQL (server)"
            ]
          },
          {
            "title": "SRE, DevOps, Infrastructure 2018 - Present Day:",
            "items": [
              "Kubernetes",
              "Terraform",
              "Helm",
              "Docker",
              "GCP",
              "AWS",
              "Linux, bash, etc..."
            ]
          },
          {
            "title": "Just general software stuff, baby 2014 - Present Day:",
            "items": [
              "Git(hub)",
              "Jira",
              "Confluence (all the Atlassian stuff)",
              "Google (like gtag and analytics not like I google how to center divs)",
              "Google (like how to center a div)",
              "Adobe (a/b testing, etc... I have legitimately seen people get hired because they said they can do 'A/B testing so here we are...')",
              "CMS (Contentful, MDX, Sanity.io, Ghost)",
              "Draw.io (yeah I've put together some charts in my days)"
            ]
          }
        ]
      }
    }
  }
}
