{
  "employment": {
    "title": "Employment History",
    "content": [
      {
        "title": "Cloudflare",
        "website": "https://www.cloudflare.com",
        "logo": "/cloudflare.png",
        "content": "Building scalable SSR solutions and providing better user experience by integrating 3rd party platforms to our Core network.",
        "tools": "Java(Type)script, Node, Astro, React, GraphQL, Gatsby, Golang, Kubernetes, Helm, GCP, Terraform, Postgres",
        "tenure": "2021 - Present",
        "job": "Senior Systems Engineer"
      },
      {
        "title": "Starship HSA",
        "website": "https://starshiphsa.com/",
        "logo": "/starshiphsa.jpeg",
        "content": "Building React Native based iOS and Android application to help monitor HSA Bank transactions. As well as a platform for stock trading.",
        "tools": "Java(Type)script, Node, Prisma, React Native, GraphQL, Express, Lerna, Postgres, AWS, Kubernetes, Helm",
        "tenure": "2020 - 2021",
        "job": "Senior Software Engineer"
      },
      {
        "title": "YouEarnedIt, Kazoo, Worktango",
        "website": "https://www.worktango.com/",
        "logo": "/worktango.png",
        "content": "Building and scaling our Ruby on Rails platform while also helping build our dashboard using React. Eventually transitioned to SRE where I helped build and maintain our infrastructure in GCP using Kubernetes.",
        "tools": "Java(Type)script, Ruby on Rails, GraphQL, React, MongoDB, GCP, Kubernetes, Spinnaker, Helm",
        "tenure": "2018 - 2020",
        "job": "Senior Software Engineer"
      },
      {
        "title": "HomeAdvisor",
        "website": "https://www.homeadvisor.com/",
        "logo": "/homeadvisor.png",
        "content": "Building our custom frontend framework to help with our survey platform. Migrated from custom framework to React.",
        "tools": "Java(Type)script, Java, React, MySQL",
        "tenure": "2017 - 2018",
        "job": "Software Engineer"
      },
      {
        "title": "OutboundEngine",
        "website": "https://www.outboundengine.com/",
        "logo": "/outboundengine.png",
        "content": "Began as a Web Designer to build our applications UI/UX. Transitioned to Software Engineer helping build our application's frontend using ExtJs and React. Worked with maintaining and building dynamic user websites with Java and MySQL.",
        "tools": "Javascript, Java, ExtJS, React, MySQL, Photoshop, Illustrator",
        "tenure": "2014 - 2017",
        "job": "Web Designer, Software Engineer"
      },
      {
        "title": "Atomic Design and Consulting",
        "website": "https://www.atomicdc.com/",
        "logo": "/atomicdc.jpeg",
        "content": "Helped design and build Wordpress themes for various customers. Worked with clients to help build their website designs and then led the development team into creating themes to be maintained by the clients.",
        "tools": "Wordpress, PHP, Javascript, Photoshop, Illustrator, Sketch",
        "tenure": "2013 - 2014",
        "job": "Web Designer, Software Engineer"
      }
    ]
  },

  "chapter": {
    "1": {
      "title": "Who am I?",
      "content": "I am a a multidisciplinary Full Stack engineer. Bringing to the table a plethora of skills and abilities alongside my 10+ years experience. Proficient in many popular languages and libraries with a very extensive skill set."
    },
    "2": {
      "title": "A little more of my history.",
      "content": {
        "1": "Having had a a range of mentors and wonderful managers. I have been able to craft my skills in every aspect of the tech world and software development lifecycle to fit a multitude of positions.",
        "2": "I got my start in the early 2013s as a web designer. At first building graphic designs for sign printing teaching myself the basics of Adobe Illustrator and Photoshop, etc. That led into a world of building UIs and UX workflows for websites. Eventually the curiosity grew, and so did the learning, continuing the path into software development learning Javascript to build upon my designs and turn them into tangible websites. Naturally, this led into backend development, learning Java, Ruby on Rails, and eventually settling into Golang constructing the backend pieces to power my frontend skills. And as time always tells, this inevitably led to learning the ins and outs of devops, infrastructure, and cloud computing. Allowing me to perform every aspect of the lifecycle in isolation or within a team."
      }
    },
    "3": {
      "title": "Where are we today?",
      "content": {
        "1": "Today I continue working as a Full Stack Engineer, continuing my learning and spending more time getting comfortable in Golang. Building more serverless and client side frontend pieces using Astro and Edge based SSR websites.",
        "2": "Outside of the world of tech I am working towards writing more and spending more time sketching and painting again. Taking care of and spending time with my family. All the while continuing to cook and jot down movie reviews from time to time."
      }
    },
    "4": {
      "title": "Where do we go from here?",
      "content": "If you have made it this far you may have an interest in working with me. That's great. Shoot me an email, let's get started."
    },
    "skills": {
      "title": "The tools of the trade",
      "content": [
        {
          "title": "Design 2012 - 2014:",
          "items": ["Adobe Illustrator", "Abode Photoshop", "Figma", "Sketch"]
        },
        {
          "title": "Frontend Development 2014 - Present Day:",
          "items": [
            "Javascript",
            "Typescript",
            "Astro",
            "React",
            "Preact",
            "Vue",
            "Gatsby",
            "GraphQL (client)"
          ]
        },
        {
          "title": "Backend Development 2016 - Present Day:",
          "items": [
            "Javascript (NodeJS)",
            "Typescript",
            "Java",
            "Ruby on Rails",
            "Golang",
            "MySQL",
            "Postgres",
            "MongoDB",
            "GraphQL (server)"
          ]
        },
        {
          "title": "SRE, DevOps, Infrastructure 2018 - Present Day:",
          "items": [
            "Kubernetes",
            "Terraform",
            "Helm",
            "Docker",
            "GCP",
            "AWS",
            "Linux, bash, etc..."
          ]
        },
        {
          "title": "Just general tech industry 2014 - Present Day:",
          "items": [
            "Git(hub)",
            "Jira and the Atlassian Suite",
            "Google (Google Tag Manager, Analytics, Optimize, etc...)",
            "Adobe (a/b testing, etc...)",
            "CMS (Contentful, MDX, Sanity.io, Ghost)",
            "Draw.io"
          ]
        }
      ]
    }
  }
}
